const fehu = [
    [0, 0, 0, 150],
    [30, 0, 0, 50],
    [50, 2, 0, 80]
]

const uruz = [
    [0, 0, 0, 150],
    [0, 0, 50, 50],
    [50, 50, 50, 150],
]

const turisaz = [
    [0, 0, 0, 150],
    [0, 50, 50, 75],
    [50, 75, 0, 100],
]


const ansuz = [
    [0, 0, 0, 150],
    [0, 0, 35, 61],
    [0, 50, 35, 105],
]


const raido = [
    [0, 0, 0, 150],
    [0, 0, 30, 50],
    [30, 50, 0, 85],
    [0, 85, 35, 146],
]

const kenaz = [
    [30, 40, 0, 75],
    [0, 75, 35, 108],
]


const gebo = [
    [0, 0, 50, 150],
    [50, 0, 0, 150 ],
]

const wunyo = [
    [0, 0, 0, 150],
    [0, 0, 50, 25],
    [50, 25, 0, 50],
]

const hagalaz = [
    [0, 0, 0, 150],
    [50, 0, 50, 150],
    [0, 40, 50, 110],
]

const dagaz = [
    [0, 0, 0, 150],
    [50, 0, 50, 150],
    [0, 0, 50, 150],
    [50, 0, 0, 150 ],
]

const futhark = [fehu, uruz, turisaz, ansuz, raido, kenaz, gebo, wunyo, hagalaz, dagaz]
const futharkUnicode = ["ᚠ", "ᚢ", "ᚦ", "ᚨ", "ᚱ", "ᚲ", "ᚷ", "ᚹ", "ᚺ", "ᚾ", "ᛁ", "ᛃ", "ᛇ", "ᛈ", "ᛉ", "ᛋ", "ᛏ","ᛒ","ᛖ","ᛗ","ᛚ","ᛜ","ᛟ","ᛞ"]
const futharkAlternatives = {
    "ᚺ":["ᚻ"],
    "ᛋ":["ᛊ"],
    "ᛜ":["ᛝ"],
}